---
type: TableCellStyleOverrideOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 20
tags: [revit-api, class]
---

# TableCellStyleOverrideOptions

`Autodesk.Revit.DB.TableCellStyleOverrideOptions` · Revit 2024 · 20 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TableCellStyleOverrideOptions | — | `` |
| Constructor | TableCellStyleOverrideOptions | 2014 | `public TableCellStyleOverrideOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetAllOverrides | 2014 | `public void SetAllOverrides ( bool bOverride )` |
| Property | BackgroundColor | 2014 | `public bool BackgroundColor { get ; set ; }` |
| Property | Bold | 2014 | `public bool Bold { get ; set ; }` |
| Property | BorderBottomLineStyle | 2014 | `public bool BorderBottomLineStyle { get ; set ; }` |
| Property | BorderLeftLineStyle | 2014 | `public bool BorderLeftLineStyle { get ; set ; }` |
| Property | BorderLineStyle | 2014 | `public bool BorderLineStyle { get ; set ; }` |
| Property | BorderRightLineStyle | 2014 | `public bool BorderRightLineStyle { get ; set ; }` |
| Property | BorderTopLineStyle | 2014 | `public bool BorderTopLineStyle { get ; set ; }` |
| Property | Font | 2014 | `public bool Font { get ; set ; }` |
| Property | FontColor | 2014 | `public bool FontColor { get ; set ; }` |
| Property | FontSize | 2014 | `public bool FontSize { get ; set ; }` |
| Property | HorizontalAlignment | 2014 | `public bool HorizontalAlignment { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Italics | 2014 | `public bool Italics { get ; set ; }` |
| Property | TextOrientation | 2014 | `public bool TextOrientation { get ; set ; }` |
| Property | Underline | 2014 | `public bool Underline { get ; set ; }` |
| Property | VerticalAlignment | 2014 | `public bool VerticalAlignment { get ; set ; }` |